app/controllers/courses_controller.rb

  def create
  	new_course = Course.new(course_params) #Course.new(course_params)
  	if new_course.save
---
INSERT INTO "courses" ("course_num", "department_id", "course_code", "section", "name", "location", "instructor", "days", "start_time", "end_time", "credits", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"